### Terraform `terraform/digitalocean`
#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.sshclient_host.managers[0] will be read during apply
  # (config refers to values not yet known)
 <= data "sshclient_host" "managers" {
      + hostname                 = (known after apply)
      + id                       = (known after apply)
      + insecure_ignore_host_key = true
      + json                     = (known after apply)
      + username                 = "keyscan"
    }

  # data.sshclient_host.nodes[0] will be read during apply
  # (config refers to values not yet known)
 <= data "sshclient_host" "nodes" {
      + hostname                 = (known after apply)
      + id                       = (known after apply)
      + insecure_ignore_host_key = true
      + json                     = (known after apply)
      + username                 = "keyscan"
    }

  # data.sshclient_keyscan.keyscan_managers[0] will be read during apply
  # (config refers to values not yet known)
 <= data "sshclient_keyscan" "keyscan_managers" {
      + authorized_key = (known after apply)
      + host_json      = (sensitive value)
      + id             = (known after apply)
    }

  # data.sshclient_keyscan.keyscan_nodes[0] will be read during apply
  # (config refers to values not yet known)
 <= data "sshclient_keyscan" "keyscan_nodes" {
      + authorized_key = (known after apply)
      + host_json      = (sensitive value)
      + id             = (known after apply)
    }

  # digitalocean_droplet.managers[0] will be created
  + resource "digitalocean_droplet" "managers" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + graceful_shutdown    = false
      + id                   = (known after apply)
      + image                = "ubuntu-20-04-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = true
      + name                 = "manager0"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = (known after apply)
      + region               = "lon1"
      + resize_disk          = true
      + size                 = "s-1vcpu-1gb"
      + ssh_keys             = (known after apply)
      + status               = (known after apply)
      + urn                  = (known after apply)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = (known after apply)
    }

  # digitalocean_droplet.nodes[0] will be created
  + resource "digitalocean_droplet" "nodes" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + graceful_shutdown    = false
      + id                   = (known after apply)
      + image                = "ubuntu-20-04-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = true
      + name                 = "node0"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = (known after apply)
      + region               = "lon1"
      + resize_disk          = true
      + size                 = "s-1vcpu-1gb"
      + ssh_keys             = (known after apply)
      + status               = (known after apply)
      + urn                  = (known after apply)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = (known after apply)
    }

  # digitalocean_project.infra-bootstrap-tools will be created
  + resource "digitalocean_project" "infra-bootstrap-tools" {
      + created_at  = (known after apply)
      + description = "Startup infra for small self-hosted project"
      + environment = "Development"
      + id          = (known after apply)
      + is_default  = false
      + name        = "infra-bootstrap-tools"
      + owner_id    = (known after apply)
      + owner_uuid  = (known after apply)
      + purpose     = "IoT"
      + resources   = (known after apply)
      + updated_at  = (known after apply)
    }

  # digitalocean_ssh_key.infra will be created
  + resource "digitalocean_ssh_key" "infra" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "infra-bootstrap-tools-digitalocean"
      + public_key  = (known after apply)
    }

  # time_sleep.wait_30_seconds will be created
  + resource "time_sleep" "wait_30_seconds" {
      + create_duration = "30s"
      + id              = (known after apply)
    }

  # tls_private_key.ssh will be created
  + resource "tls_private_key" "ssh" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + known_hosts  = (known after apply)
  + managers_ips = [
      + (known after apply),
    ]
  + nodes_ips    = [
      + (known after apply),
    ]
  + ssh_key      = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @xNok, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Plan`*